<!DOCTYPE html>
<html>
<head>
<title>Projekt Terv</title>
</head>
<body>
<h1><strong>Projekt Terv</strong><h1>
<h2>Csoport tagjai, strukt&uacute;r&aacute;ja</h2>
<p><strong>&nbsp;</strong></p>
<p>Bodn&aacute;r L&aacute;szl&oacute;: Webfejlesztő, Tesztelő</p>
<p>Siska D&aacute;vid: Adatb&aacute;zis, Webfejlesztő, Fejlesztő</p>
<p>Szűcs Mil&aacute;n: Adatb&aacute;zis, Applik&aacute;ci&oacute; fejlesztő</p>
<p>Klecsk&oacute;&nbsp;Bence: Applik&aacute;ci&oacute; fejlesztő, Tesztelő</p>
<p>Bar&aacute;th Krist&oacute;f: Tesztelő, Dokument&aacute;ci&oacute; k&eacute;sz&iacute;tő, Modellező, Fejlesztő</p>
<p>&nbsp;</p>
<h2>Projekt</h2>
<p>Egy szolg&aacute;ltat&aacute;s l&eacute;trehoz&aacute;sa. A felhaszn&aacute;l&oacute; online,&nbsp;mobilos&nbsp;vagy ak&aacute;r szem&eacute;lyes v&aacute;s&aacute;rl&aacute;s keretein bel&uuml;l vehet jegyet, b&eacute;rletet &eacute;s egy&eacute;b a rendszerben megtal&aacute;lhat&oacute; szolg&aacute;ltat&aacute;st a rendszeren kereszt&uuml;l.</p>
<p>A rendszer egy felhő alap&uacute; szolg&aacute;ltat&aacute;son &eacute;s weboldalon alapszik. Felhaszn&aacute;l&oacute;n&eacute;v &eacute;s jelsz&oacute; seg&iacute;ts&eacute;g&eacute;vel megv&aacute;s&aacute;rolt szolg&aacute;ltat&aacute;sok ak&aacute;rhonnan el&eacute;rhetőek (Web, mobil&nbsp;app.).</p>
<h2>Fejleszt&eacute;si terv</h2>
<p>3. H&eacute;t: Specifik&aacute;ci&oacute; befejez&eacute;se, tervez&eacute;s, dokument&aacute;l&aacute;s elkezd&eacute;se.</p>
<p>6. H&eacute;t: Tervez&eacute;s befejez&eacute;se, fejleszt&eacute;s, tesztel&eacute;s elkezd&eacute;se, dokument&aacute;ci&oacute; folytat&aacute;sa.</p>
<p>9. H&eacute;t: Fejleszt&eacute;s befejez&eacute;se, dokument&aacute;ci&oacute; befejez&eacute;se, program tesztel&eacute;se &eacute;les k&ouml;r&uuml;lm&eacute;nyek k&ouml;z&ouml;tt.</p>
<p>13. H&eacute;t: &Aacute;tad&aacute;s</p>
<h2>Programoz&oacute;i nyelvek, fejlesztő eszk&ouml;z&ouml;k</h2>
<p>-&nbsp;&nbsp;HTML, CSS, JavaScript: A webfejleszt&eacute;s elsődleges komponensei. K&ouml;nnyen haszn&aacute;lhat&oacute;. Minden b&ouml;ng&eacute;szőmotor tudja &eacute;rtelmezni. Futtat&aacute;sa gyors &eacute;s probl&eacute;mamentes.</p>
<p>-&nbsp;&nbsp;Java: a v&aacute;laszt&aacute;sunk a Java-ra&nbsp;esett, mivel ebben van a legt&ouml;bb tapasztalatunk.</p>
<p>-&nbsp;&nbsp;MySQL&nbsp;:&nbsp;Sz&uuml;ks&eacute;g&uuml;nk van egy kisebb adatb&aacute;zisra a megv&aacute;s&aacute;rolt jegyek, b&eacute;rletek &eacute;s szem&eacute;lyes adatok t&aacute;rol&aacute;s&aacute;hoz, amire a&nbsp;MySQL&nbsp;t&ouml;k&eacute;letesen megfelel.</p>
<p>-&nbsp;&nbsp;AWS Cloud Storage, AWS&nbsp;RDS(Relational&nbsp;Database&nbsp;Service): Felhő alap&uacute; szolg&aacute;ltat&aacute;son szeretn&eacute;nk t&aacute;rolni az adatainkat, &iacute;gy az Amazon szolg&aacute;ltat&aacute;sain&aacute;l d&ouml;nt&ouml;tt&uuml;nk, mivel ingyen haszn&aacute;lhat&oacute;, am&iacute;g nem l&eacute;p&uuml;nk &aacute;t bizonyos korl&aacute;tokat.</p>
<p>-&nbsp;&nbsp;Autodesk&nbsp;AutoCAD: Szeretn&eacute;nk megval&oacute;s&iacute;tani egy jegykiad&oacute; automata &aacute;ltal biztos&iacute;tott v&aacute;s&aacute;rl&aacute;si form&aacute;t is, ennek modellez&eacute;s&eacute;t ebben a szoftverben szeretn&eacute;nk elv&eacute;gezni.</p>
<h2>Haszn&aacute;lni k&iacute;v&aacute;nt eszk&ouml;z&ouml;k, technik&aacute;k</h2>
<p>-&nbsp;&nbsp;Eclipse/IntelliJ: Fejlesztők&ouml;rnyezet, a fejlesztők egy&eacute;ni d&ouml;nt&eacute;se szerint.</p>
<p>-&nbsp;&nbsp;MySQL&nbsp;workbench/phpmyadmin/command&nbsp;line: Adatb&aacute;zis kezel&eacute;s&eacute;re, a fejlesztők egy&eacute;ni d&ouml;nt&eacute;se, melyikkel prefer&aacute;lnak dolgozni.&nbsp;- Visual&nbsp;Studio&nbsp;Code:K&ouml;nnyen&nbsp;haszn&aacute;lhat&oacute; fejlesztői fel&uuml;let HTML, CSS, JavaScript-hez. Kiterjeszt&eacute;sek &eacute;rhetők el hozz&aacute;, amelyek megk&ouml;nny&iacute;tik a fejleszt&eacute;st.</p>
<p>-&nbsp;&nbsp;Amazon Web&nbsp;Services&nbsp;:&nbsp;Felhő alap&uacute; szolg&aacute;ltat&aacute;s adatok t&aacute;rol&aacute;s&aacute;ra.</p>
<p>-&nbsp;&nbsp;Android&nbsp;Studio: Egyszerű UI k&eacute;sz&iacute;t&eacute;s, felhaszn&aacute;l&oacute;bar&aacute;t fejlesztői fel&uuml;let. Egyik legjobb v&aacute;laszt&aacute;s v&eacute;lem&eacute;ny&uuml;nk szerint&nbsp;androidos&nbsp;appok&nbsp;k&eacute;sz&iacute;t&eacute;s&eacute;re.</p>
<p><strong>Produktumok &eacute;s l&eacute;trej&ouml;tt&uuml;k ideje</strong></p>
<p>6. h&eacute;t: V&iacute;zi&oacute; dokumentum</p>
<p>8. h&eacute;t: SRS dokumentum</p>
<p>12. h&eacute;t Dokument&aacute;ci&oacute;</p>
<h2>Tesztel&eacute;si k&ouml;vetelm&eacute;nyek</h2>
<p>-&nbsp;&nbsp;Minimum 65-70%-os&nbsp;code&nbsp;coverage, unit testekkel.</p>
<p>-&nbsp;&nbsp;T&ouml;k&eacute;letes, probl&eacute;ma mentes gyors fut&aacute;s.</p>
<p>-&nbsp;&nbsp;Felhaszn&aacute;l&oacute;bar&aacute;t haszn&aacute;lhat&oacute;s&aacute;g ellenőrz&eacute;se.</p>
<p><strong>Bemutat&aacute;s &eacute;s sz&aacute;ll&iacute;t&aacute;s m&oacute;dja</strong></p>
<p>13. h&eacute;t: A projekt &oacute;rai bemutat&aacute;sa</p>
<h2>Inform&aacute;ci&oacute; forr&aacute;sok</h2>
<p><a href="https://developer.mozilla.org/hu/">https://developer.mozilla.org/hu/</a><a href="https://developer.mozilla.org/hu/">&nbsp;</a><a href="https://docs.oracle.com/en/java/">https://docs.oracle.com/en/java/</a></p>

</body>
</html>
